Step 1. Import the necessary libraries

In [1]:
# Import pandas for data manipulation and numpy for numerical operations
import pandas as pd
import numpy as np

Step 2. Create 3 differents Series, each of length 100, as follows

In [2]:
# Create three Pandas Series, count excludes number indicated in 'high'
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(series1, series2, series3)

0     2
1     1
2     4
3     1
4     3
     ..
95    3
96    1
97    3
98    4
99    2
Length: 100, dtype: int32 0     2
1     2
2     2
3     3
4     2
     ..
95    2
96    1
97    2
98    3
99    2
Length: 100, dtype: int32 0     23300
1     27544
2     14472
3     20007
4     28866
      ...
95    23324
96    28879
97    18774
98    18010
99    16838
Length: 100, dtype: int32

Step 3. Create a DataFrame by joinning the Series by column

In [3]:
# Use concat function to join columns
housing = pd.concat([series1, series2, series3], axis=1)

housing.head()

   0  1      2
0  2  2  23300
1  1  2  27544
2  4  2  14472
3  1  3  20007
4  3  2  28866

Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
# Renaming columns
housing.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)

housing.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            23300
1      1       2            27544
2      4       2            14472
3      1       3            20007
4      3       2            28866

Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
# Join all series in one column and assign name
bigcolumn = pd.concat([series1, series2, series3], axis=0)

# Change type from series to data frame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       1
2       4
3       1
4       3
..    ...
95  23324
96  28879
97  18774
98  18010
99  16838

[300 rows x 1 columns]

Step 6. Ops it seems it is going only until index 99. Is it true?

In [6]:
# Check the number of columns
len(bigcolumn)

# Index is only until 99 initially since the series are just combined and the indexes are kept

300

Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
# Resets the index of the DataFrame 'bigcolumn' to a default integer index, dropping the existing index from original series
bigcolumn.reset_index(drop=True, inplace=True)

bigcolumn

         0
0        2
1        1
2        4
3        1
4        3
..     ...
295  23324
296  28879
297  18774
298  18010
299  16838

[300 rows x 1 columns]